In [3]:
import pandas as pd 
import matplotlib as pyplot
import seaborn as sns

In [4]:
df = pd.read_csv("heights_with_outliers.csv")
df.tail()

        name  height
995    Susan    5.51
996    Sarah    5.85
997    Susan    6.12
998  Michael    5.81
999    David    5.41

In [6]:
mean = round(df.height.mean() , 2 )
std = round(df.height.std() , 2 )
mean , std

(5.61, 0.37)

In [15]:
# create new column z_score
df["z_score"] = round(( df["height"] - mean ) / std , 2 )
df.tail()

        name  height  z_score
995    Susan    5.51    -0.27
996    Sarah    5.85     0.65
997    Susan    6.12     1.38
998  Michael    5.81     0.54
999    David    5.41    -0.54

In [16]:
# detect outliers 
df[(df.z_score < -3 ) | (df.z_score > +3 ) ]

       name  height  z_score
1   Deepika     8.2     7.00
16    Tanvi     3.2    -6.51
57    Priya     3.4    -5.97
76    Aarav     9.4    10.24